------------------------------------------------------------------------
-- Set to leader key
------------------------------------------------------------------------
vim.g.mapleader = " "
vim.g.maplocalleader = "\\"

local opt = vim.opt

------------------------------------------------------------------------
-- Enable auto write
------------------------------------------------------------------------
opt.autowrite = true

------------------------------------------------------------------------
-- Sync with system clipboard
------------------------------------------------------------------------
opt.clipboard = vim.env.SSH_TTY and "" or "unnamedplus"

------------------------------------------------------------------------
-- UI setting
------------------------------------------------------------------------
opt.number = true 		-- 显示行号
opt.wrap = false		-- 行内不折叠
opt.list = true 		-- 显示tab字符
opt.tabstop = 4       	-- 一个 tab 显示为 4 个空格
opt.shiftwidth = 4    	-- 缩进时用 4 个空格
opt.softtabstop = 4   	-- 插入模式按 Tab = 4 个空格
opt.expandtab = true  	-- Tab 转换为空格
